# Програма для конвертації текстових смайлів у емоджі

# 1. Користувач вводить текст, в якому можуть бути смайлики

# 2. Вивести текст, в якому текстові смайлики замінені на відповідні емоджі.

# Карта відповідності смайлика до емоджі:

# - `:)` = 🙂 U0001F642
# - `XD` = 😂 U0001F923
# - `:(` = 🙁 U0001F641
# - `>:(` = 😠 U0001F620
# - `>:)` = 😈 U0001F608

dict_emoji = {'>:(': '\U0001F620',
              '>:)': '\U0001F608',
              ':)': '\U0001F642',
              'XD': '\U0001F923',
              ':(': '\U0001F641'}

string = input("Введіть фразу зі смайликами \U0001F606 :")

print("Ви ввели фразу:", string)

for key in dict_emoji:

    print(key, "=", dict_emoji[key])

    string = string.replace(key, dict_emoji[key])

print(string)
